# Python for Data Analysis - Workbook 2 (Pandas Basics)

### Preliminaries

In [2]:
import numpy as np
import pandas as pd

## Basic Data Structures

### Series

In [4]:
# A Series is a one-dimensional array-like object containing a sequence of values, 
# and an associated array called an index

obj = pd.Series([5,-2,13,4])
obj

0     5
1    -2
2    13
3     4
dtype: int64

In [5]:
# We can set the index by passing in an additional arg:

obj = pd.Series([5,-2,13,4], index = ['a', 'c', 'd', 'b'])
obj

a     5
c    -2
d    13
b     4
dtype: int64

In [10]:
# Can also create a Series directly from a Python dict

capitals = {'New York': 'Albany', 'Arizona': 'Phoenix', 'Montana': 'Helena'}
pd.Series(capitals)

# Can also change the index order by passing in the dict keys to the index arg in the order you want to appear
# Missing values will appear as NA

pd.Series(capitals, index = ['Montana', 'Arizona', 'New York', 'Texas'])

Montana      Helena
Arizona     Phoenix
New York     Albany
Texas           NaN
dtype: object

In [15]:
# Checking for missing data

capitals = {'New York': 'Albany', 'Arizona': 'Phoenix', 'Montana': 'Helena'}
pd.Series(capitals)
capitals2 = pd.Series(capitals, index = ['Montana', 'Arizona', 'New York', 'Texas'])

capitals2.isnull()
# pd.isnull(capitals2)
# capitals2.notnull()
# pd.notnull(capitals2)

Montana      True
Arizona      True
New York     True
Texas       False
dtype: bool

In [30]:
# Both the Series object and index have a name attribute which can be changed

a = {'Red': 29, 'Blue': 42, 'Green': 24}
obj = pd.Series(a)
obj.name = 'Numbers'
obj.index.name = 'Colors'
print(obj)
print(obj.index)

Colors
Red      29
Blue     42
Green    24
Name: Numbers, dtype: int64
Index(['Red', 'Blue', 'Green'], dtype='object', name='Colors')

In [34]:
# Can alter index in place by assignment

obj = pd.Series([29, 42, 24], index = ['Red', 'Blue', 'Green'])
obj.index = ['Purple', 'Yellow', 'Orange']
obj

Purple    29
Yellow    42
Orange    24
dtype: int64

### Dataframe

In [35]:
# Rectangular table of data and ordered collection of columns of different value types
# Can represent higher-dimensional data through hierarchical indexing

In [39]:
# One way to create is from a dict of equal-lengh lists or NumPy arrays

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

pd.DataFrame(data)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [48]:
# Select first five (or any whatever number is passed in) rows of a DF

data = pd.DataFrame({
            'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 
            'year': [2000, 2001, 2002, 2001, 2002, 2003],
            'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
        })

data.head()
# data.head(3)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [49]:
# Can specify columns in the order that you want

pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [50]:
# Non-existent columns will just populate with NaN 

pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'])

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [54]:
# Can select with either dict-like or attribute-like access

data['year']
# data.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [58]:
# Retrieve rows with 'loc' attribute

data.loc[0]

state    Ohio
year     2000
pop       1.5
Name: 0, dtype: object

In [74]:
# Columns can be modified by assignment
# Can be either a scalar

frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'])

frame2['debt'] = 10
frame2

   year   state  pop  debt
0  2000    Ohio  1.5    10
1  2001    Ohio  1.7    10
2  2002    Ohio  3.6    10
3  2001  Nevada  2.4    10
4  2002  Nevada  2.9    10
5  2003  Nevada  3.2    10

In [75]:
# or another array

frame2['debt'] = np.random.randint(0,20,6)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5     3
1  2001    Ohio  1.7     1
2  2002    Ohio  3.6     3
3  2001  Nevada  2.4     6
4  2002  Nevada  2.9     3
5  2003  Nevada  3.2    15

In [76]:
# Can delete with the del method

del frame2['debt']
frame2

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [77]:
# Note that selecting a column on the underlying dataframe returns a view and not a copy. So can modify in place

print(frame2['pop'])
print('\n')
frame2['pop'] = 0
frame2['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

0    0
1    0
2    0
3    0
4    0
5    0
Name: pop, dtype: int64

In [81]:
# Another way to create a df is to pass a nested dictionary
# Outer keys become columns and inner keys are rows
# Can transpose just like a numpy array

frame3 = pd.DataFrame({'Nevada': {'2002': 100, '2003': 150}, 'Ohio': {'2002': 500, '2003': 450}})
print(frame3)
frame3.T

      Nevada  Ohio
2002     100   500
2003     150   450

        2002  2003
Nevada   100   150
Ohio     500   450

#### Index Objects

In [4]:
# Responsible for holding axis labels and other metadata like axis name or names

obj = pd.Series(range(3), index=['a', 'b', 'c'])
index  = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [16]:
# Note these are immutable, and behave similar to Python sets (though you can have dup values)
# But since they are like sets you can use similar methods

firstIndex = pd.Series(range(3), index = ['a', 'b', 'c']).index
secondIndex = pd.Series(range(3), index = ['c', 'd', 'e']).index

firstIndex.difference(secondIndex)
firstIndex.union(secondIndex)
firstIndex.intersection(secondIndex)
firstIndex.isin(['a'])

array([ True, False, False])

In [10]:
# Join to indices using append()

firstIndex = pd.Series(range(3), index = ['a', 'b', 'c']).index
secondIndex = pd.Series(range(3), index = ['d', 'e', 'f']).index

joined = firstIndex.append(secondIndex)
print(joined)

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [20]:
# Check if each index value is greater than previous

obj = pd.Series(range(3), index=['a', 'b', 'c'])
print(obj.is_monotonic)

# Check if each index value is unique
print(obj.is_unique)

True
True

In [31]:
# print all unique values from the index (e.g. create a set)

obj = pd.Series(range(4), index=['a', 'b', 'c', 'c'])

indexSet = set(obj.index.unique())
print(indexSet)

{'c', 'b', 'a'}

### Reindexing

In [47]:
# Reindexing creates a new object with the data conformed to the new index (missing values as NaN)

vals = np.random.randn(3)
idx = ['a', 'b', 'c']
obj = pd.Series(vals, idx)

newIdx = ['a', 'b', 'c', 'd']
newObj = obj.reindex(newIdx)
newObj

a   -0.175440
b   -0.942898
c   -1.163431
d         NaN
dtype: float64

In [54]:
# Several methods to interpolate, such as ffill (pulls forward from last) or bfill (grabs next and fills)

vals = np.random.randn(3)
idx = range(0,6,2)
obj = pd.Series(vals, idx)
obj

newIdx = range(6)
# newObj = obj.reindex(newIdx).bfill()
newObj = obj.reindex(newIdx).ffill()
newObj

0   -0.259501
1   -0.259501
2    0.347639
3    0.347639
4   -0.708284
5   -0.708284
dtype: float64

In [64]:
# For a dataframe, reindex can alter rows, columns or both. 

frame = pd.DataFrame(np.arange(9).reshape(3, 3), index = ['a', 'b', 'c'], columns = ['Texas', 'California', 'New York'])

# Alter rows when only a sequence is passed

frame2 = frame.reindex(['a', 'b', 'f', 'g'])
print(frame2)
print('\n')

# Pass a 'columns' keyword to alter columns
states = ['Arizona', 'California', 'Montana']
frame3 = frame.reindex(columns=states)
print(frame3)

   Texas  California  New York
a    0.0         1.0       2.0
b    3.0         4.0       5.0
f    NaN         NaN       NaN
g    NaN         NaN       NaN


   Arizona  California  Montana
a      NaN           1      NaN
b      NaN           4      NaN
c      NaN           7      NaN